Перем КонтекстЯдра;
Перем БазовыеУтверждения;  //БазовыеУтверждения
Перем Ожидаем;      //УтвержденияBDD

//Перем ВременныеФайлы; //ВременныеФайлы
//Перем ГенераторОтчетаJUnitXML;//ГенераторОтчетаJUnitXML
//Перем ГенераторОтчетаMXL;//ГенераторОтчетаMXL
//Перем ЗагрузчикИзПодсистемКонфигурации;//ЗагрузчикИзПодсистемКонфигурации
//Перем ЗагрузчикКаталога;//ЗагрузчикКаталога
//Перем ЗагрузчикФайла;//ЗагрузчикФайла
//Перем ЗапросыИзБД;//ЗапросыИзБД
//Перем КомандныйФайл;//КомандныйФайл
//Перем ПарсерКоманднойСтроки;//ПарсерКоманднойСтроки
//Перем ПостроительДереваТестов;//ПостроительДереваТестов
//Перем СериализаторMXL;//СериализаторMXL
//Перем СтроковыеУтилиты;//СтроковыеУтилиты
//Перем УтвержденияПроверкаТаблиц;//УтвержденияПроверкаТаблиц

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
    КонтекстЯдра						= КонтекстЯдраПараметр;
    БазовыеУтверждения					= КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем								= КонтекстЯдра.Плагин("УтвержденияBDD");
	
	//ВременныеФайлы						= КонтекстЯдра.Плагин("ВременныеФайлы");
	//ГенераторОтчетаJUnitXML				= КонтекстЯдра.Плагин("ГенераторОтчетаJUnitXML");
	//ГенераторОтчетаMXL					= КонтекстЯдра.Плагин("ГенераторОтчетаMXL");
	//ЗагрузчикИзПодсистемКонфигурации	= КонтекстЯдра.Плагин("ЗагрузчикИзПодсистемКонфигурации");
	//ЗагрузчикКаталога					= КонтекстЯдра.Плагин("ЗагрузчикКаталога");
	//ЗагрузчикФайла						= КонтекстЯдра.Плагин("ЗагрузчикФайла");
	//ЗапросыИзБД							= КонтекстЯдра.Плагин("ЗапросыИзБД");
	//КомандныйФайл						= КонтекстЯдра.Плагин("КомандныйФайл");
	//ПарсерКоманднойСтроки				= КонтекстЯдра.Плагин("ПарсерКоманднойСтроки");
	//ПостроительДереваТестов				= КонтекстЯдра.Плагин("ПостроительДереваТестов");
	//СериализаторMXL						= КонтекстЯдра.Плагин("СериализаторMXL");
	//СтроковыеУтилиты					= КонтекстЯдра.Плагин("СтроковыеУтилиты");
	//УтвержденияПроверкаТаблиц			= КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("ТестДолжен_проверить_выполняемость_функции_");
	
КонецПроцедуры

//+-----------------------------------------------------------------------
//{ Блок юнит-тестов
//+-----------------------------------------------------------------------

Процедура ПередЗапускомТеста() Экспорт
    НачатьТранзакцию();
КонецПроцедуры
Процедура ПослеЗапускаТеста() Экспорт
    Если ТранзакцияАктивна() Тогда
        ОтменитьТранзакцию();
    КонецЕсли;
КонецПроцедуры

//шаблон теста
Процедура ТестДолжен_проверить_выполняемость_функции_() Экспорт
	
	__здесь_имя_общего_модуля_или_объект_обработки_ = Неопределено;
	
	//параметры метода должны передаваться через массив. пример массива ниже
	мПараметры = новый Массив;
	мПараметры.Добавить(  ); 
	мПараметры.Добавить(  ); 
	мПараметры.Добавить(  ); 
	мПараметры.Добавить(  ); 
	
	БазовыеУтверждения.ПроверитьМетодВыполнился(__здесь_имя_общего_модуля_или_объект_обработки_, "__сюда_пишем_имя_метода", мПараметры, "");
	
КонецПроцедуры
