rem дл€ создани€ пустой базы дл€ новой фичи из хранилища
rem »нструкци€
rem 1. в папке new_base лежит чиста€ база. если это не так - надо сделать.
rem  чтобы не создават базу руками, она будет скопирована оттуда
rem 2. скопировать скрипт в целевой каталог новой базы
rem 3. запустить скрипт
rem  омментарии к коду
rem ¬ыражение .\ означает текущий каталог, откуда запускаетс€ скрипт
rem ¬ыражение && выполн€ет склеивание нескольких команд в одну
rem здесь оно примен€етс€ дл€ того, чтобы запустилась команда dbupdate,
rem т.к. команда loadrepo завершает работу скрипта, независимо от того,
rem есть после нее строки или нет
rem TODO сделать авторегистрацию новой базы в стартере
chcp 1251
copy /y e:\workspace\MicexTrader\DEV_Area\new_base\ .\
deployka loadrepo /F.\ e:\workspace\MicexTrader\MainStorage\ -storage-user –азработчик && deployka dbupdate /F.\ -allow-warnings