rem для создания пустой базы для новой фичи из хранилища
rem Инструкция
rem 1. создать пустую файловую базу через стартер 1С
rem 2. скопировать скрипт в целевой каталог новой базы
rem 3. запустить скрипт
rem Комментарии к коду
rem Выражение .\ означает текущий каталог, откуда запускается скрипт
rem Выражение && выполняет склеивание нескольких команд в одну
rem здесь оно применяется для того, чтобы запустилась команда dbupdate,
rem т.к. команда loadrepo завершает работу скрипта, независимо от того,
rem есть после нее строки или нет
chcp 1251
deployka loadrepo /F.\ e:\workspace\MicexTrader\MainStorage\ -storage-user Разработчик && deployka dbupdate /F.\ -allow-warnings