//общий модуль. Клиент-сервер

//
Функция Инициализация (Шаблон, ИскатьДоПервогоСовпадения = Истина, МногоСтрок = Истина, ИгнорироватьРегистр = Истина) Экспорт

    RegExp = Новый COMОбъект("VBScript.RegExp");    // создаем объект для работы с регулярными выражениями

    //Заполняем данные
    RegExp.MultiLine = МногоСтрок;                  // истина — текст многострочный, ложь — одна строка
    RegExp.Global = Не ИскатьДоПервогоСовпадения;   // истина — поиск по всей строке, ложь — до первого совпадения
    RegExp.IgnoreCase = ИгнорироватьРегистр;        // истина — игнорировать регистр строки при поиске
    RegExp.Pattern = Шаблон;                        // шаблон (регулярное выражение)

	Возврат RegExp;
	
КонецФункции

//Метод test проверяет, есть ли хоть одно совпадение в строке str. Возвращает true/false.
//Работает, по сути, так же, как и проверка str.search(reg) != -1,
Функция Проверка(RegExp, ПроверяемыйТекст)  Экспорт

    Возврат RegExp.Test(ПроверяемыйТекст);

КонецФункции

//
Функция Выполнить(RegExp, АнализируемыйТекст) Экспорт

    РезультатАнализаСтроки = RegExp.Execute(АнализируемыйТекст);

    МассивВыражений = Новый Массив;

    Для Каждого Выражение Из РезультатАнализаСтроки Цикл
        СтруктураВыражение = Новый Структура ("Начало, Длина, Значение, ПодВыражения", Выражение.FirstIndex, Выражение.Length,Выражение.Value);

        //Обработка подвыражений
        МассивПодВыражений = Новый Массив;
        Для Каждого ПодВыражение Из Выражение.SubMatches Цикл
            МассивПодВыражений.Добавить(ПодВыражение);
        КонецЦикла;
        СтруктураВыражение.ПодВыражения = МассивПодВыражений;

        МассивВыражений.Добавить (СтруктураВыражение);

    КонецЦикла;

    Возврат МассивВыражений;

КонецФункции

//str.search(reg). возвращает позицию первого совпадения или -1, если ничего не найдено.
Функция Поиск(RegExp, ИскомыйТекст)  Экспорт

    Возврат RegExp.Search(ИскомыйТекст);

КонецФункции

//str.match(reg) без флага g. В этом случае str.match(reg) находит только одно, первое совпадение.
//Результат вызова – это массив, состоящий из этого совпадения, с дополнительными свойствами index – позиция,
//на которой оно обнаружено и input – строка, в которой был поиск.
//У этого массива не всегда только один элемент.
Функция Совпадение(RegExp, ИскомыйТекст)  Экспорт

    РезультатАнализаСтроки = RegExp.Execute(ИскомыйТекст);
	
	Возврат РезультатАнализаСтроки.Count>0;
	
	//МассивВыражений = Новый Массив;

	//Для Каждого Выражение Из РезультатАнализаСтроки Цикл
	//	СтруктураВыражение = Новый Структура ("Начало, Длина, Значение, ПодВыражения", Выражение.FirstIndex, Выражение.Length,Выражение.Value);

	//	//Обработка подвыражений
	//	МассивПодВыражений = Новый Массив;
	//	Для Каждого ПодВыражение Из Выражение.SubMatches Цикл
	//		МассивПодВыражений.Добавить(ПодВыражение);
	//	КонецЦикла;
	//	СтруктураВыражение.ПодВыражения = МассивПодВыражений;

	//	МассивВыражений.Добавить (СтруктураВыражение);

	//КонецЦикла;

	//Возврат МассивВыражений.Количество()>0;


КонецФункции


