//модуль для тестирования трассировщика.
//в измененном модуле трассировщик должен добавить вызовы логирования

Функция ВыполнитьТрассировкуМодуля(	ИсходныйТекст, 
									Параметр8,
									Параметр9,
									Параметр1) Экспорт

	а = НайтиФайлы();
	Для Каждого Эл из а Цикл
	КонецЦикла;
	
КонецФункции

Функция НайтиЗначениеВыражения(	ИсходныйТекст, 
	Параметр8,
	Параметр9,
	Параметр1) 

	а = НайтиФайлы();
	Для Каждого Эл из а Цикл
	КонецЦикла;

КонецФункции

Функция 
	ВыполнитьТрассировкуМодуля
	(
	ИсходныйТекст, 
	Параметр8,
	Параметр9,
	Параметр1
	)
	Экспорт

	f = 1;
	Сообщить(12);
КонецФункции