//модуль для тестирования трассировщика.
//в измененном модуле трассировщик должен добавить вызовы логирования

Процедура Старт(Параметр1 = 0, Парамет2 = 9)

КонецПроцедуры

Функция Вызов1(Параметр3)

	Сообщить(Параметр3);

КонецФункции

Функция Вызов2(Параметр4, Параметр5)

КонецФункции

Процедура Вызов3(Параметр6, Параметр7 = 78)

КонецПроцедуры

Procedure Вызов3(Параметр6, Параметр7 = 78)
	
EndProcedure

Функция СкопироватьФайлы(Источник, Приемник)
	
КонецФункции
	
Функция ВыполнитьТрассировкуМодуля(	ИсходныйТекст, 
									Параметр8,
									Параметр9,
									Параметр1) Экспорт
	
КонецФункции

Функция СкопироватьФайлы
	(Источник, Приемник)
	
КонецФункции