	НастройкиЛогирования = Обработки.НастройкиЛогированияЛог.Создать();
	Если НастройкиЛогирования.ПрочитатьИзКонфигурации("ИмпортОтчетаБрокераОткрытие") = Неопределено Тогда
		НастройкиЛогирования.ЗаписатьВКонфигурацию("ИмпортОтчетаБрокераОткрытие", НастройкиЛогирования.УровниЛога.Отладка, СоздатьНастройкуЛога());
	КонецЕсли;
	
	МенеджерЛогирования = Обработки.МенеджерЛогированияЛог.Создать();
	Лог = МенеджерЛогирования.ПолучитьЛог("ИмпортОтчетаБрокераОткрытие");

	Лог.Информация("Начали загрузку данных из файла <%1>", ИмяФайла);
	
	...
	
	Лог.Информация("Закончили загрузку данных из файла <%1>", ИмяФайла);
	Лог.Закрыть();
	Лог = Неопределено;

